# Самостоятельное задание 1 (+1 балл к оценке за курс).

In [23]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [24]:
all_info = pd.concat([pd.read_csv("Data/Students_info_" + str(i) + ".csv") for i in range(10)])
all_marks = pd.concat([pd.read_csv("Data/Students_marks_" + str(i) + ".csv") for i in range(10)])

df = pd.concat([all_info, all_marks], axis=1)
df.head(7)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,index,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,0,72,72,74
1,1,female,group C,some college,standard,completed,group1,1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,2,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,3,47,57,44
4,4,male,group C,some college,standard,none,group1,4,76,78,75
5,5,female,group B,associate's degree,standard,none,group1,5,71,83,78
6,6,female,group B,some college,standard,completed,group1,6,88,95,92

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [25]:
df.drop("index", axis=1, inplace=True)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [26]:
print("table size is:", len(df.index), "x", len(df.columns))

table size is: 1000 x 9

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [27]:
df.describe().drop(["count", "25%", "50%", "75%"], axis=0)

      math score  reading score  writing score
mean    66.08900      69.169000      68.054000
std     15.16308      14.600192      15.195657
min      0.00000      17.000000      10.000000
max    100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [28]:
count_empty = 0
for i in range(len(df.columns)):
    count_empty += len(df.index) - df[df.columns[i]].count()
    print("В столбце", df.columns[i] + ":", len(df.index) - df[df.columns[i]].count(), "пропущенных значений")
    
print("\nВсего в таблице", count_empty, "пропущенных значений")

В столбце gender: 0 пропущенных значений
В столбце race/ethnicity: 0 пропущенных значений
В столбце parental level of education: 0 пропущенных значений
В столбце lunch: 0 пропущенных значений
В столбце test preparation course: 0 пропущенных значений
В столбце group: 0 пропущенных значений
В столбце math score: 0 пропущенных значений
В столбце reading score: 0 пропущенных значений
В столбце writing score: 0 пропущенных значений

Всего в таблице 0 пропущенных значений

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [57]:
for i in range(len(df.columns)):
    if df[df.columns[i]].dtype != "object":
        print(df.columns[i], "mean:", df[df.columns[i]].mean())

math score mean: 66.089
reading score mean: 69.169
writing score mean: 68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [58]:
df["test preparation course"].value_counts()

none         642
completed    358
Name: test preparation course, dtype: int64

In [64]:
for i in range(len(df.columns)):
    if df[df.columns[i]].dtype != "object":
        print(df.columns[i], "means")
        print("\twith the test prep course:", df[(df["test preparation course"] == "completed")][df.columns[i]].mean())
        print("\twithout the test prep course:", df[(df["test preparation course"] == "none")][df.columns[i]].mean())

math score means
	with the test prep course: 69.69553072625699
	without the test prep course: 64.0778816199377
reading score means
	with the test prep course: 73.89385474860335
	without the test prep course: 66.53426791277259
writing score means
	with the test prep course: 74.41899441340782
	without the test prep course: 64.50467289719626

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [70]:
for value in set(df.lunch):
    print(value)

free/reduced
standard

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [88]:
df.rename(columns={"parental level of education":"education", "test preparation course":"test preparation"}, inplace=True)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [89]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [112]:
print("passed math:", (df["math score"] >= passmark).mean())
print("attended test prep and passed math:", (df[(df["test preparation"] == "completed")]["math score"] >= passmark).mean())
print("women who didnt attend test prep and didnt pass math:", (df[(df["gender"] == "female") & (df["test preparation"] == "none")]["math score"] < passmark).mean())

passed math: 0.865
attended test prep and passed math: 0.9217877094972067
women who didnt attend test prep and didnt pass math: 0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [113]:
%%time

df.groupby("race/ethnicity")["reading score"].mean()

CPU times: user 1.28 ms, sys: 588 µs, total: 1.87 ms
Wall time: 1.33 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [114]:
%%time

df.groupby("education")["writing score"].min()

CPU times: user 1.3 ms, sys: 544 µs, total: 1.85 ms
Wall time: 1.29 ms

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [115]:
%%time

print("reading score mean")
for group in set(df["race/ethnicity"]):
    print("\t" + group + ":", df[(df["race/ethnicity"] == group)]["reading score"].mean())

reading score mean
	group B: 67.35263157894737
	group E: 73.02857142857142
	group C: 69.10344827586206
	group D: 70.03053435114504
	group A: 64.67415730337079
CPU times: user 5.83 ms, sys: 1.91 ms, total: 7.74 ms
Wall time: 6.29 ms

In [116]:
%%time

print("writing score min")
for group in set(df["education"]):
    print("\t" + group + ":", df[(df["education"] == group)]["writing score"].min())

writing score min
	bachelor's degree: 38
	some college: 19
	associate's degree: 35
	some high school: 10
	high school: 15
	master's degree: 46
CPU times: user 6.66 ms, sys: 1.94 ms, total: 8.61 ms
Wall time: 7.23 ms

Время выполнения заданий с помощью циклов явно больше, чем с помощью groupby.

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [117]:
grouped = pd.pivot_table(df, index=["gender","education"],values=[df.columns[i] for i in range(len(df.columns)) if df[df.columns[i]].dtype != "object"])
grouped

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [122]:
df["Math_PassStatus"] = df["math score"].apply(lambda x: 'F' if x < passmark else 'P')
df["Reading_PassStatus"] = df["reading score"].apply(lambda x: 'F' if x < passmark else 'P')
df["Writing_PassStatus"] = df["writing score"].apply(lambda x: 'F' if x < passmark else 'P')
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P

In [123]:
print("math:")
df["Math_PassStatus"].value_counts()

math:

P    865
F    135
Name: Math_PassStatus, dtype: int64

In [124]:
print("reading:")
df["Reading_PassStatus"].value_counts()

reading:

P    910
F     90
Name: Reading_PassStatus, dtype: int64

In [125]:
print("writing:")
df["Writing_PassStatus"].value_counts()

writing:

P    886
F    114
Name: Writing_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [139]:
df["OverAll_PassStatus"] = df.apply(lambda x: 'F' if x["Math_PassStatus"] == 'F' or x["Reading_PassStatus"] == 'F' or x["Writing_PassStatus"] == 'F' else 'P', axis=1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      90 и больше = A
####      80-89 = B
####      70-79 = C
####      60-69 = D
####      50-59 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [140]:
import numpy as np

In [146]:
def GetGrade(average_mark):
    if (average_mark >= 90):
        return 'A'
    if (average_mark >= 80):
        return 'B'
    if (average_mark >= 70):
        return 'C'
    if (average_mark >= 60):
        return 'D'
    if (average_mark >= 50):
        return 'E'
    return 'F'

df["Grade"] = df[["math score", "reading score", "writing score"]].apply(lambda x: GetGrade(x.values.mean()), axis=1)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,GG,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P,72.666667,C
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P,82.333333,B
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P,92.666667,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F,49.333333,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P,76.333333,C

In [147]:
df["Grade"].value_counts()

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64